---
type: SolidGeometryOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# SolidGeometryOptions

`Autodesk.Revit.DB.SolidGeometryOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SolidGeometryOptions | 2019 | `public SolidGeometryOptions ( int solidTag )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SolidTag | 2019 | `public int SolidTag { get ; set ; }` |